№1
x <- matrix(rnorm(50), ncol=5, nrow=10)
print(x)
#rnorm генерує багатовимірні нормальні випадкові змінні в просторі x.


№2
#функція apply() використовується у випадках, коли необхідно застосувати будь-яку функцію до всіх рядків або стовпців матриці (або масивів більшої розмірності)
#нам треба знайти максимальне значення у КОЖНОМУ стовпці
#застосувати (X, MARGIN, FUN)
#  -x: масив або матриця
#  -MARGIN: візьміть значення або діапазон від 1 до 2, щоб визначити, де застосувати функцію:
#  -MARGIN=1`: маніпуляція виконується над рядками
#  -MARGIN=2`: маніпуляція виконується над стовпцями
#  -FUN - дія

print(apply(x, 2, max))


№3
print(apply(x, 2, mean))


№4
print(apply(x, 1, min))


№5
print(apply(x, 2, order))
#під кодом міститься змінна x, яка включає вектор зі списком чисел. Числа впорядковуються відповідно до його індексу за допомогою order(x)


№6
a <- function(x) 
  {
  return (sum(x < 0))
  }

print(apply(x, 2, a))


№7
#булеві змінні, значеннями цього типу можуть бути тільки True або False
is_any_element_more_than_two <- function(x) 
  {
  return (sum(x > 2))
  }

print(apply(x, 2, is_any_element_more_than_two))
#бачимо, що результат видає бінарною відповіддю, а нам треба булевими змінними
#будь-яке число, яке не дорівнює нулю (або NA) інтерпретують як «істина». 
#числа, які дорівнюють нулю, порожні об'єкти інтерпретуюють як «хибність».

is_any_element_more_than_two <- function(x) 
  {
  return (sum(x > 2) > 0)
  }


№8
list1 <- list(observationA = c(1:5, 7:3), observationB = matrix(1:6, nrow=2))
print(list1)
#у першому випадку нас просять створити вектор з чисел спочатку від 1 до 5, потім від 7 до 3 
#у другому випадку нас просять створити матрицю з чисел від 1 до 6 на 2 рядки
lapply(list1, sum)
#lapply() використовується за потреби застосування певної функції до кожної компоненти списку. У такому випадку одержують результат у вигляді списку 
#буква “l” в назві lapply() означає list – “список”.


№9
sapply(list1, range)


№10
#Дані InsectSprays в R показують кількість комах у сільськогосподарських експериментальних одиницях, оброблених шістьма різними інсектизидами. 
#Ми можемо використовувати ці дані, щоб вивчити відносну ефективність різних інсектизидів.
InsectSprays
#split розділяє вхідні дані (x) на різні групи (f)
a <- with(InsectSprays, split(count, spray))
print(a)

print(sapply(a, mean))
